---
kind: property
id: P:Autodesk.Revit.DB.LayerModifier.Separator
source: html/007e4867-d885-3c7b-1a4c-3552bb9bc2b4.htm
---
# Autodesk.Revit.DB.LayerModifier.Separator Property

The separator string that will follow this modifier in the export layer name.

## Syntax (C#)
```csharp
public string Separator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null